<?php
$page_options = [
  'title' => 'Компоненты - UI/UX',
];

require "templates/menu.php";

$pdf_icon = '<svg width="24" height="26" viewBox="0 0 24 26" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M1 1H17.1075L23 7.85638V25H1V1Z" stroke="#004C95" stroke-width="2"/>
<path d="M4.5552 20.856C4.4016 21.0096 4.2216 21.0864 4.0152 21.0864C3.8088 21.0864 3.6288 21.0096 3.4752 20.856C3.3216 20.7024 3.2448 20.5224 3.2448 20.316C3.2448 20.1096 3.3216 19.9296 3.4752 19.776C3.6288 19.6224 3.8088 19.5456 4.0152 19.5456C4.2216 19.5456 4.4016 19.6224 4.5552 19.776C4.7088 19.9296 4.7856 20.1096 4.7856 20.316C4.7856 20.5224 4.7088 20.7024 4.5552 20.856ZM7.17026 21H5.71586V16.1976H8.27906C8.82146 16.1976 9.24386 16.356 9.54626 16.6728C9.85346 16.9848 10.0071 17.376 10.0071 17.8464C10.0071 18.312 9.85346 18.7032 9.54626 19.02C9.24386 19.332 8.82146 19.488 8.27906 19.488H7.17026V21ZM8.09186 18.2208C8.22146 18.2208 8.32706 18.1896 8.40866 18.1272C8.49026 18.06 8.53106 17.9664 8.53106 17.8464C8.53106 17.7216 8.49026 17.628 8.40866 17.5656C8.32706 17.4984 8.22146 17.4648 8.09186 17.4648H7.17026V18.2208H8.09186ZM12.9238 21H10.771V16.1976H12.9166C13.6942 16.1976 14.3278 16.4112 14.8175 16.8384C15.3071 17.2608 15.5519 17.8464 15.5519 18.5952C15.5519 19.344 15.3071 19.932 14.8175 20.3592C14.3278 20.7864 13.6966 21 12.9238 21ZM12.9166 19.7328C13.267 19.7328 13.5478 19.6224 13.759 19.4016C13.9702 19.1808 14.0758 18.912 14.0758 18.5952C14.0758 18.2544 13.9774 17.9808 13.7806 17.7744C13.5838 17.568 13.2982 17.4648 12.9238 17.4648H12.2254V19.7328H12.9166ZM17.815 21H16.3606V16.1976H20.0038V17.4648H17.815V17.94H19.9534V19.2072H17.815V21Z" fill="#004C95"/>
</svg>';

?>
<!doctype html>
<html lang="ru">
<?php require "templates/header.php"; ?>

<div class="container">
  <h1 class="text-center">UI компоненты</h1>
  <h2>Download block</h2>
  <div class="row">
    <div class="col-12 col-sm-3">
        <a class="c-download__link" href="#">
          <div class="c-download__desc">Скачать каталог Dreno Compatta</div>
          <div class="c-download__divider"></div>
          <div class="c-download__icon"><?=$pdf_icon?></div>
        </a>
    </div>
    <div class="col-12 col-sm-3">
      <a class="c-download__link white" href="#">
        <div class="c-download__desc">Скачать каталог</div>
        <div class="c-download__divider"></div>
        <div class="c-download__icon"><?=$pdf_icon?></div>
      </a>
    </div>
    <div class="col-12 col-sm-2">1</div>
    <div class="col-12 col-sm-2">1</div>
    <div class="col-12 col-sm-2">1</div>
  </div>
</div>

<?php require_once "templates/footer.php"; ?>
